# FamilyMismatchCircuitDisconnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricityFailures..::..FamilyMismatchCircuitDisconnected Property
BuiltInFailures..::..ElectricityFailures Class See Also
---
The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyMismatchCircuitDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyMismatchCircuitDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyMismatchCircuitDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricityFailures Class
Autodesk.Revit.DB Namespace